ra-rs/ra/svd/vendor/R7FA6E10F.svd
                <register>
                    <dim>3</dim>
                    <dimIncrement>0x10</dimIncrement>
                    <dimIndex>0-2</dimIndex>
                    <name>RHRCP%s</name>
                    <description>Hour Capture Register %s</description>
                    <alternateRegister>BCNT2CP%s</alternateRegister>
                    <addressOffset>0x56</addressOffset>
                    <size>8</size>
                    <access>read-only</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0x00</resetMask>
                    <fields>
                        <field>
                            <name>HR1</name>
                            <description>1-Hour Capture</description>
                            <lsb>0</lsb>
                            <msb>3</msb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>HR10</name>
                            <description>10-Hour Capture</description>
                            <lsb>4</lsb>
                            <msb>5</msb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>PM</name>
                            <description>PM</description>
                            <lsb>6</lsb>
                            <msb>6</msb>
                            <access>read-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>AM</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>PM</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <dim>3</dim>
                    <dimIncrement>0x10</dimIncrement>
                    <dimIndex>0-2</dimIndex>
                    <name>BCNT3CP%s</name>
                    <description>BCNT3 Capture Register %s</description>
                    <addressOffset>0x5A</addressOffset>
                    <size>8</size>
                    <access>read-only</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0x00</resetMask>
                </register>
                <register>
                    <dim>3</dim>
                    <dimIncrement>0x10</dimIncrement>
                    <dimIndex>0-2</dimIndex>
                    <name>RDAYCP%s</name>
                    <description>Date Capture Register %s</description>
                    <alternateRegister>BCNT3CP%s</alternateRegister>
                    <addressOffset>0x5A</addressOffset>
                    <size>8</size>
                    <access>read-only</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0x00</resetMask>
                    <fields>
                        <field>
                            <name>DATE1</name>
                            <description>1-Day Capture</description>
                            <lsb>0</lsb>
                            <msb>3</msb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>DATE10</name>
                            <description>10-Day Capture</description>
                            <lsb>4</lsb>
                            <msb>5</msb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <dim>3</dim>
                    <dimIncrement>0x10</dimIncrement>
                    <dimIndex>0-2</dimIndex>
                    <name>RMONCP%s</name>
                    <description>Month Capture Register %s</description>
                    <addressOffset>0x5C</addressOffset>
                    <size>8</size>
                    <access>read-only</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0xe0</resetMask>
                    <fields>
                        <field>
                            <name>MON1</name>
                            <description>1-Month Capture</description>
                            <lsb>0</lsb>
                            <msb>3</msb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>MON10</name>
                            <description>10-Month Capture</description>
                            <lsb>4</lsb>
                            <msb>4</msb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
            </registers>
        </peripheral>
        <peripheral>
            <name>IWDT</name>
            <description>Independent Watchdog Timer</description>
            <baseAddress>0x40083200</baseAddress>
            <addressBlock>
                <offset>0x00</offset>
                <size>1</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x04</offset>
                <size>2</size>
                <usage>registers</usage>
            </addressBlock>
            <registers>
                <register>
                    <name>IWDTRR</name>
                    <description>IWDT Refresh Register</description>
                    <addressOffset>0x00</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0xff</resetValue>
                    <resetMask>0xff</resetMask>
                </register>
                <register>
                    <name>IWDTSR</name>
                    <description>IWDT Status Register</description>
                    <addressOffset>0x04</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0000</resetValue>
                    <resetMask>0xffff</resetMask>
                    <fields>
                        <field>
                            <name>CNTVAL</name>
                            <description>Down-counter Value</description>
                            <lsb>0</lsb>
                            <msb>13</msb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>UNDFF</name>
                            <description>Underflow Flag</description>
                            <lsb>14</lsb>
                            <msb>14</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>No underflow occurred</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Underflow occurred</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>REFEF</name>
                            <description>Refresh Error Flag</description>
                            <lsb>15</lsb>
                            <msb>15</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>No refresh error occurred</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Refresh error occurred</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
