ra-rs/ra/svd/vendor/R7FA6E10F.svd
                <register>
                    <name>GTCCRF</name>
                    <description>General PWM Timer Compare Capture Register F</description>
                    <addressOffset>0x60</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0xffffffff</resetValue>
                    <resetMask>0xffffffff</resetMask>
                </register>
                <register>
                    <name>GTPR</name>
                    <description>General PWM Timer Cycle Setting Register</description>
                    <addressOffset>0x64</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0xffffffff</resetValue>
                    <resetMask>0xffffffff</resetMask>
                </register>
                <register>
                    <name>GTPBR</name>
                    <description>General PWM Timer Cycle Setting Buffer Register</description>
                    <addressOffset>0x68</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0xffffffff</resetValue>
                    <resetMask>0xffffffff</resetMask>
                </register>
                <register>
                    <name>GTDTCR</name>
                    <description>General PWM Timer Dead Time Control Register</description>
                    <addressOffset>0x88</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xffffffff</resetMask>
                    <fields>
                        <field>
                            <name>TDE</name>
                            <description>Negative-Phase Waveform Setting</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>GTCCRB is set without using GTDVU</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>GTDVU is used to set the compare match value for negative-phase waveform with dead time automatically in GTCCRB</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>GTDVU</name>
                    <description>General PWM Timer Dead Time Value Register U</description>
                    <addressOffset>0x8C</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0xffffffff</resetValue>
                    <resetMask>0xffffffff</resetMask>
                </register>
                <register>
                    <name>GTICLF</name>
                    <description>General PWM Timer Inter Channel Logical Operation Function Setting Register</description>
                    <addressOffset>0xB8</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xffffffff</resetMask>
                    <fields>
                        <field>
                            <name>ICLFA</name>
                            <description>GTIOCnA Output Logical Operation Function Select</description>
                            <lsb>0</lsb>
                            <msb>2</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>000</name>
                                    <description>A (no delay)</description>
                                    <value>#000</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>001</name>
                                    <description>NOT A (no delay)</description>
                                    <value>#001</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>010</name>
                                    <description>C (1PCLKD delay)</description>
                                    <value>#010</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>011</name>
                                    <description>NOT C (1PCLKD delay)</description>
                                    <value>#011</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>100</name>
                                    <description>A AND C (1PCLKD delay)</description>
                                    <value>#100</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>101</name>
                                    <description>A OR C (1PCLKD delay)</description>
                                    <value>#101</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>110</name>
                                    <description>A EXOR C (1PCLKD delay)</description>
                                    <value>#110</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>111</name>
                                    <description>A NOR C (1PCLKD delay)</description>
                                    <value>#111</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>ICLFSELC</name>
                            <description>Inter Channel Signal C Select</description>
                            <lsb>4</lsb>
                            <msb>9</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0x00</name>
                                    <description>GTIOC0A</description>
                                    <value>0x00</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>0x01</name>
                                    <description>GTIOC0B</description>
                                    <value>0x01</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>0x02</name>
                                    <description>GTIOC1A</description>
                                    <value>0x02</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>0x03</name>
                                    <description>GTIOC1B</description>
                                    <value>0x03</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>0x04</name>
                                    <description>GTIOC2A</description>
                                    <value>0x04</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>0x05</name>
                                    <description>GTIOC2B</description>
                                    <value>0x05</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>0x06</name>
                                    <description>GTIOC3A</description>
                                    <value>0x06</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>0x07</name>
                                    <description>GTIOC3B</description>
                                    <value>0x07</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>0x08</name>
                                    <description>GTIOC4A</description>
                                    <value>0x08</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>0x09</name>
                                    <description>GTIOC4B</description>
                                    <value>0x09</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>0x0A</name>
                                    <description>GTIOC5A</description>
                                    <value>0x0a</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>0x0B</name>
                                    <description>GTIOC5B</description>
                                    <value>0x0b</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>0x0C</name>
                                    <description>GTIOC6A</description>
                                    <value>0x0c</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>0x0D</name>
                                    <description>GTIOC6B</description>
                                    <value>0x0d</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>0x0E</name>
                                    <description>GTIOC7A</description>
                                    <value>0x0e</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>0x0F</name>
                                    <description>GTIOC7B</description>
                                    <value>0x0f</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>0x10</name>
                                    <description>GTIOC8A</description>
                                    <value>0x10</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>0x11</name>
                                    <description>GTIOC8B</description>
                                    <value>0x11</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>0x12</name>
                                    <description>GTIOC9A</description>
                                    <value>0x12</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>0x13</name>
                                    <description>GTIOC9B</description>
                                    <value>0x13</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>Others</name>
                                    <description>Setting prohibited</description>
                                    <isDefault>true</isDefault>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>ICLFB</name>
                            <description>GTIOCnB Output Logical Operation Function Select</description>
                            <lsb>16</lsb>
                            <msb>18</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>000</name>
                                    <description>B (no delay)</description>
                                    <value>#000</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>001</name>
                                    <description>NOT B (no delay)</description>
                                    <value>#001</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>010</name>
                                    <description>D (1PCLKD delay)</description>
                                    <value>#010</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>011</name>
                                    <description>NOT D (1PCLKD delay)</description>
                                    <value>#011</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>100</name>
                                    <description>B AND D (1PCLKD delay)</description>
                                    <value>#100</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>101</name>
                                    <description>B OR D (1PCLKDn delay)</description>
                                    <value>#101</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>110</name>
                                    <description>B EXOR D (1PCLKD delay)</description>
                                    <value>#110</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>111</name>
                                    <description>B NOR D (1PCLKD delay)</description>
                                    <value>#111</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>ICLFSELD</name>
                            <description>Inter Channel Signal D Select</description>
                            <lsb>20</lsb>
                            <msb>25</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0x00</name>
                                    <description>GTIOC0A</description>
                                    <value>0x00</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>0x01</name>
                                    <description>GTIOC0B</description>
                                    <value>0x01</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>0x02</name>
                                    <description>GTIOC1A</description>
                                    <value>0x02</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>0x03</name>
                                    <description>GTIOC1B</description>
                                    <value>0x03</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>0x04</name>
                                    <description>GTIOC2A</description>
                                    <value>0x04</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>0x05</name>
                                    <description>GTIOC2B</description>
                                    <value>0x05</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>0x06</name>
                                    <description>GTIOC3A</description>
                                    <value>0x06</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>0x07</name>
                                    <description>GTIOC3B</description>
                                    <value>0x07</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>0x08</name>
                                    <description>GTIOC4A</description>
                                    <value>0x08</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>0x09</name>
                                    <description>GTIOC4B</description>
                                    <value>0x09</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>0x0A</name>
                                    <description>GTIOC5A</description>
                                    <value>0x0a</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>0x0B</name>
                                    <description>GTIOC5B</description>
                                    <value>0x0b</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>0x0C</name>
                                    <description>GTIOC6A</description>
                                    <value>0x0c</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>0x0D</name>
                                    <description>GTIOC6B</description>
                                    <value>0x0d</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>0x0E</name>
                                    <description>GTIOC7A</description>
                                    <value>0x0e</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>0x0F</name>
                                    <description>GTIOC7B</description>
                                    <value>0x0f</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>0x10</name>
                                    <description>GTIOC8A</description>
                                    <value>0x10</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>0x11</name>
                                    <description>GTIOC8B</description>
                                    <value>0x11</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>0x12</name>
                                    <description>GTIOC9A</description>
                                    <value>0x12</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>0x13</name>
                                    <description>GTIOC9B</description>
                                    <value>0x13</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>Others</name>
                                    <description>Setting prohibited</description>
                                    <isDefault>true</isDefault>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
